[
  {
    "title": "Animate Bootstrap 3 Menu Icon To (X)",
    "summary": "In this post we are going to animate the Bootstrap Navigation Icon that is displayed in mobile devices. We'll be animating the transition from the Hamburger Icon (☰) to a Close Icon (×). This effect is used in many Webpages and Mobile Devices such as Android Devices. Let's get started!!",
    "imageUrl": "https://i.imgur.com/wuKtuYc.jpg",
    "slug": "animate-bootstrap-menu-icon-to-x",
    "markdown": "![](https://i.imgur.com/wuKtuYc.jpg)\n\n# Animate Bootstrap Menu Icon To (X)\n\nIn this post we are going to animate the Bootstrap Navigation Icon that is displayed in mobile devices. We'll be animating the transition from the Hamburger Icon (&#9776;) to a Close Icon (&#215;). This effect is used in many Webpages and Mobile Devices such as Android Devices. Let's get started!!!\n\n### Pre-requisite\n1. Have Bootstrap already added to your page.\n2. Have a navbar component already added to your page. \n\n### The Trick\nWhenever the user clicks on the menu button, Bootstrap will remove the \"collapsed\" class in our menu button. Our trick consists of animating to a close icon (&#215;) whenever the \"collapsed\" class is not present in our menu button and to a Hamburger icon (&#9776;) when it is.\n\n### Close icon - (&#215;)\nFirst we'll be creating the Close Icon (&#215;). We need to target all of our menu icon bars by using the \".navbar-toggle span.icon-bar\" in our CSS and set the animation transition speed to 300ms or whatever value works for you.\n```css\n.navbar-toggle span.icon-bar {\n  -webkit-transition: all 300ms;\n  transition: all 300ms;\n}\n```\nNext we'll be targeting each bar individually. We are going to start with the first bar icon. First, we need to center it horizontally and then rotate it 45deg. We will accomplish this by using the translate and rotate values of the transform property.\n```css\n.navbar-toggle span.icon-bar:nth-child(2) {\n  -webkit-transform: translateY(300%) rotate(45deg);\n  transform: translateY(300%) rotate(45deg);\n}\n```\n**NOTE:** *We are targeting the \"nth-child(2)\" because Bootstrap contains a screen reading span tag within our menu button as the first span. So the first icon bar is actually the second span.*\n\nNow, for the middle bar icon the effect we are aiming for is to fade out the bar icon as the transition is happening. To accomplish this effect, we are going to target the middle bar and set the opacity property to the value of 0.\n```css\n.navbar-toggle span.icon-bar:nth-child(3) {\n  opacity: 0;\n}\n```\nThe last bar icon is similar to the first bar icon but with negative values.\n```css\n.navbar-toggle span.icon-bar:nth-child(4) {\n  -webkit-transform: translateY(-300%) rotate(-45deg);\n  transform: translateY(-300%) rotate(-45deg);\n}\n```\nNow we should be able to see the Close Icon in our navigation bar.\n\n### Hamburger icon - (&#9776;)\nThe Hamburger icon is very simple. All we have to do is to reset all the values we used to create the Close Icon. If you remember from the \"The Trick\" section, we'll do this whenever the \"collapsed\" class is present in our menu button.\n\nFor the first and last bar icon, we'll be resetting the translate and rotate values to 0. \n```css\n.navbar-toggle.collapsed span.icon-bar:nth-child(2) {\n  -webkit-transform: translateY(0) rotate(0);\n}\n\n.navbar-toggle.collapsed span.icon-bar:nth-child(4) {\n  -webkit-transform: translateY(0) rotate(0);\n}\n```\nAnd for the middle bar icon, we'll be resetting the opacity value back to 1.\n```css\n.navbar-toggle.collapsed span.icon-bar:nth-child(3) {\n  opacity: 1;\n}\n```\nNow we should be able to see the effect. The 3 bars of our navigation menu should turn into an (X) whenever the menu is open and turn back to the 3 bars whenever the menu is close.\n\n### Here is a Codepen version\n\n<p class=\"codepen\" data-height=\"300\" data-default-tab=\"result\" data-slug-hash=\"OXYpGG\" data-user=\"chrsolr\" style=\"height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\">\n  <span>See the Pen <a href=\"https://codepen.io/chrsolr/pen/OXYpGG\">\n  Bootstrap Menu Icon to &quot;X&quot;</a> by Christian Soler (<a href=\"https://codepen.io/chrsolr\">@chrsolr</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.</span>\n</p>\n<script async src=\"https://cpwebassets.codepen.io/assets/embed/ei.js\"></script>\n\nThank you for reading!!!"
  },
  {
    "title": "(Unofficial) Xbox Achievements Android App",
    "summary": "Back in 2012 while in attending college, I started working on an Android application. The application was a version of the website XboxAchievements.com (Formerly known as x360achievements.org).",
    "imageUrl": "https://i.imgur.com/daUg2ue.jpg",
    "slug": "unofficial-xboxachievementscom-android-app",
    "markdown": "![](https://i.imgur.com/daUg2ue.jpg)\n# (Unofficial) XboxAchievements.com Android App\n\nBack in 2012 while in attending college, I started working on an Android application. The application was a version of the website [XboxAchievements.com](http://www.xboxachievements.com/) (Formerly known as x360achievements.org). \n\n### About XboxAchievements.com\n[XA.com](http://www.xboxachievements.com/)  and sister site [playstationtrophies.org](http://www.playstationtrophies.org/) are well known sites within the video game community. These websites has almost, if not all Microsoft Games Achievements. Not only you can find game achievements but also latest news, screenshots, videos and much more. Even to this date these websites never had been mobile friendly. Since I was studying Software Development in college, I decided to create an Android version of the website and take on the challenge of learning Android Development.\n\n### Idea #1\nThe main concept was to intergrade most of the main functionality from the website. Such as News, Game Information and Achievements. [XA.com](http://www.xboxachievements.com/) didn't have an API that I could of use and because of it, I had two approaches to accomplish my goals:\n\n 1. [WebView](https://developer.android.com/reference/android/webkit/WebView.html) \n 2. [Web Scraping](https://en.wikipedia.org/wiki/Web_scraping)\n\nI decided to go with the second option. First, I had to learn the basics of HTML. Next I had to learn Web Scraping in JAVA. I kind of had to learned HTML while working on the application. I used [JSoup](https://jsoup.org/) to the Web Scraping. After taking a couple Android tutorials online and knowing how to extract the data from the website, I build a simple Prototype.\n \n[x360a Prototype (2013) - Video](https://www.youtube.com/embed/9Y4HtTGhc1Y)\n\nI kept exclusively working on the application while attending school. I could say I spend around 6 hours daily working on the application and learning about Android. While working on the application, I kept asking for permission to use the website information for my application, but I was never contacted with an answer. About a year after of the initial prototype, I had released 6 alpha version in [XDA](https://www.xda-developers.com/) and [XA.com](http://www.xboxachievements.com/) forums.\n\nHere is a video for [XA Alpha v0.0.6 (2014)](https://www.youtube.com/embed/qCvBWdGFEFQ)\n\n### The second idea\nAfter many tries to get permission from the website admins, I decided to stop development and shift focus to make a similar application. The new application would be less tied to [XA.com](http://www.xboxachievements.com/). Around the same time I had moved to Texas, USA and started studying Web Development. While studying Web Development, I started working on Xchievements application.\n\n**Xchievements** focus on a social aspect to the game's achievements. User could leave comments in achievement asking for help or helping other users. So how **Xchievements** worked? If a user logged in, the information presented to the user came from my database. But if the user logged in as an admin, the user was presented with information coming from [XA.com](http://www.xboxachievements.com/). As an admin, the user could extract game information like achievements from [XA.com](http://www.xboxachievements.com/) and store it in my database, and then a normal user can see the information. I decided not to continue with this idea because the database I was using went out of bunisses. ([Parse](http://parseplatform.org/)) \n**NOTE: ** *The process described here might not be legal.* \n\nHere is video for Xchievements: [Xchievements Promo](https://www.youtube.com/embed/Sb2X2VhuPgY)\n\n### Current Idea\nSince stopping development for **Xchievements** until about a month ago, I have been an iPhone user and really haven't keep up with Android Apps or Development. Around a month ago I got me an Android phone and while searching Google Play Store I found this: [Guide for Xbox Achievements](https://play.google.com/store/apps/details?id=it.michcorp.android.xboxachievementsguide&hl=en). Seeing this got me back into original idea. I rebooted **XA** Development with the intent of releasing the application. This time around the application will include all feature from the previous versions and more. \n\nHead over to the [XDA Thread](https://forum.xda-developers.com/android/apps-games/app-xa-unofficial-xboxachievements-com-t3600450) to tried the application and help me with feedbacks and suggestions. \n\nThank You"
  }
]